#undef    __STDC_WANT_SECURE_LIB__
#define   __STDC_WANT_SECURE_LIB__ 0


//#define STORPORT_W8

#include <ntddk.h> 
#include "common.h"
#include "wrk2003.h"

#ifdef __cplusplus
extern "C" {
#endif

typedef enum _STORPORT_FUNCTION_CODE_W10 {
    ///////////////////////////////////////////
    //      Windows 2003
    ExtFunctionAllocatePool,
    ExtFunctionFreePool,
    ExtFunctionAllocateMdl,
    ExtFunctionFreeMdl,
    ExtFunctionBuildMdlForNonPagedPool,
    ExtFunctionGetSystemAddress,
    ExtFunctionGetOriginalMdl,
    ExtFunctionCompleteServiceIrp,
    ExtFunctionGetDeviceObjects,
    ExtFunctionBuildScatterGatherList,
    ExtFunctionPutScatterGatherList,

    ///////////////////////////////////////////
    //      Vista
    ExtFunctionAcquireMSISpinLock,
    ExtFunctionReleaseMSISpinLock,
    ExtFunctionGetMessageInterruptInformation,
    ExtFunctionInitializePerformanceOptimizations,
    ExtFunctionGetStartIoPerformanceParameters,

    ///////////////////////////////////////////
    //      Windows 7
    ExtFunctionLogSystemEvent,
    ExtFunctionGetCurrentProcessorNumber,
    ExtFunctionGetActiveGroupCount,
    ExtFunctionGetGroupAffinity,
    ExtFunctionGetActiveNodeCount,
    ExtFunctionGetNodeAffinity,
    ExtFunctionGetHighestNodeNumber,
    ExtFunctionGetLogicalProcessorRelationship,
    ExtFunctionAllocateContiguousMemorySpecifyCacheNode,
    ExtFunctionFreeContiguousMemorySpecifyCache,    // 25
    
    ///////////////////////////////////////////

    //      Windows 10
    ExtFunctionRegistryReadAdapterKey,
    ExtFunctionRegistryWriteAdapterKey,
    ExtFunctionSetAdapterBusType,
    ExtFunctionPoFxRegisterPerfStates,
    ExtFunctionPoFxSetPerfState,
    ExtFunctionGetD3ColdSupport,                    // 67
    ExtFunctionInitializeRpmb,
    ExtFunctionAllocateHmb,
    ExtFunctionFreeHmb,
    ExtFunctionPropagateIrpExtension,
    ExtFunctionInterlockedInsertHeadList,
    ExtFunctionInterlockedInsertTailList,
    ExtFunctionInterlockedRemoveHeadList,
    ExtFunctionInitializeSpinlock,
    ExtFunctionGetPfns,
    ExtFunctionInitializeCryptoEngine,
    ExtFunctionGetRequestCryptoInfo,
    ExtFunctionMiniportTelemetry
} STORPORT_FUNCTION_CODE, *PSTORPORT_FUNCTION_CODE;


#define STOR_STATUS_SUCCESS                 (0x00000000L)
#define STOR_STATUS_UNSUCCESSFUL            (0xC1000001L)
#define STOR_STATUS_NOT_IMPLEMENTED         (0xC1000002L)
#define STOR_STATUS_INSUFFICIENT_RESOURCES  (0xC1000003L)
#define STOR_STATUS_BUFFER_TOO_SMALL        (0xC1000004L)
#define STOR_STATUS_ACCESS_DENIED           (0xC1000005L)
#define STOR_STATUS_INVALID_PARAMETER       (0xC1000006L)
#define STOR_STATUS_INVALID_DEVICE_REQUEST  (0xC1000007L)
#define STOR_STATUS_INVALID_IRQL            (0xC1000008L)
#define STOR_STATUS_INVALID_DEVICE_STATE    (0xC1000009L)
#define STOR_STATUS_INVALID_BUFFER_SIZE     (0xC100000AL)
#define STOR_STATUS_UNSUPPORTED_VERSION     (0xC100000BL)
#define STOR_STATUS_BUSY                    (0xC100000CL)


#define IOCTL_ACPI_ASYNC_EVAL_METHOD \
        CTL_CODE(FILE_DEVICE_ACPI, 0, METHOD_BUFFERED, FILE_READ_ACCESS | FILE_WRITE_ACCESS)

#if defined(_WIN64) || defined(_M_ALPHA)
#define STOR_ADDRESS_ALIGN           DECLSPEC_ALIGN(8)
#else
#define STOR_ADDRESS_ALIGN
#endif


///////////////////////////////////////////
// storport.lib
ULONG
StorPortInitialize (
    PVOID Argument1,
    PVOID Argument2,
    struct _HW_INITIALIZATION_DATA *HwInitializationData,
    PVOID HwContext );

BOOLEAN
StorPortRegistryRead (
    PVOID HwDeviceExtension,
    PUCHAR ValueName,
    ULONG Global,
    ULONG Type,
    PUCHAR Buffer,
    PULONG BufferLength );

ULONG
StorPortExtendedFunction (
    STORPORT_FUNCTION_CODE FunctionCode,
    PVOID HwDeviceExtension,
    ... );

// storport.lib
///////////////////////////////////////////


enum _STOR_SYNCHRONIZATION_MODEL
{
    StorSynchronizeHalfDuplex = 0,
    StorSynchronizeFullDuplex = 1
};

enum _INTERRUPT_SYNCHRONIZATION_MODE
{
    InterruptSupportNone = 0,
    InterruptSynchronizeAll = 1,
    InterruptSynchronizePerMessage = 2
};

enum _RAID_OBJECT_TYPE
{
    RaidUnknownObject = -1,
    RaidAdapterObject = 0,
    RaidUnitObject = 1,
    RaidDriverObject =  2
};

enum _DEVICE_STATE
{
    DeviceStateNotPresent = 0,
    DeviceStateWorking = 1,
    DeviceStateStopped = 2,
    DeviceStatePendingStop = 3,
    DeviceStatePendingRemove = 4,
    DeviceStateSurpriseRemoval = 5,
    DeviceStateDeleted = 6,
    DeviceStateDisabled = 7,
    DeviceStateNoResource = 8
};


typedef struct _STOR_LOCKED_LIST            // Size=0x10
{
    KSPIN_LOCK          Lock;   // Offset=0x0 Size=0x4
    struct _LIST_ENTRY  List;   // Offset=0x4 Size=0x8
    unsigned long       Count;  // Offset=0xc Size=0x4
} STOR_LOCKED_LIST;


typedef struct _STOR_DICTIONARY             // Size=0x1c
{
    unsigned long        EntryCount;                            // Offset=0x0 Size=0x4
    unsigned long        MaxEntryCount;                         // Offset=0x4 Size=0x4
    enum _POOL_TYPE      PoolType;                              // Offset=0x8 Size=0x4
    struct _LIST_ENTRY  *Entries;                               // Offset=0xc Size=0x4
    void                *(*GetKeyRoutine)(struct _LIST_ENTRY *);// Offset=0x10 Size=0x4
    long                (*CompareKeyRoutine)(void *, void *);   // Offset=0x14 Size=0x4
    unsigned long       (*HashKeyRoutine)(void *);              // Offset=0x18 Size=0x4
} STOR_DICTIONARY;


typedef struct _RAID_RESOURCE_LIST          // Size=0x8
{
    struct _CM_RESOURCE_LIST *AllocatedResources;   // Offset=0x0 Size=0x4
    struct _CM_RESOURCE_LIST *TranslatedResources;  // Offset=0x4 Size=0x4
} RAID_RESOURCE_LIST;


typedef struct _ACCESS_RANGE                // Size=0x10
{
    union _LARGE_INTEGER RangeStart;    // Offset=0x0 Size=0x8
    unsigned long        RangeLength;   // Offset=0x8 Size=0x4
    unsigned char        RangeInMemory; // Offset=0xc Size=0x1
} ACCESS_RANGE;


typedef struct _MEMORY_REGION               // Size=0x18
{
    unsigned char       *VirtualBase;   // Offset=0x0 Size=0x4
    unsigned char __align0[4];          // Offset=0x4 Size=0x4
    PHYSICAL_ADDRESS     PhysicalBase;  // Offset=0x8 Size=0x8
    unsigned long        Length;        // Offset=0x10 Size=0x4
} MEMORY_REGION;


typedef struct _RAID_BUS_INTERFACE          // Size=0x24
{
    unsigned char                   Initialized; // Offset=0x0 Size=0x1
    struct _BUS_INTERFACE_STANDARD  Interface;   // Offset=0x4 Size=0x20
} RAID_BUS_INTERFACE;


typedef struct _STOR_SCSI_ADDRESS           // Size=0x4
{
    unsigned char PathId;               // Offset=0x0 Size=0x1
    unsigned char TargetId;             // Offset=0x1 Size=0x1
    unsigned char Lun;                  // Offset=0x2 Size=0x1
    unsigned char Reserved;             // Offset=0x3 Size=0x1
} STOR_SCSI_ADDRESS;


typedef struct STOR_ADDRESS_ALIGN _STOR_ADDR_BTL8 { // Size=0xc
    unsigned short Type;          // Offset=0x0 Size=0x2
    unsigned short Port;          // Offset=0x2 Size=0x2
    unsigned long  AddressLength; // Offset=0x4 Size=0x4
    unsigned char  Path;          // Offset=0x8 Size=0x1
    unsigned char  Target;        // Offset=0x9 Size=0x1
    unsigned char  Lun;           // Offset=0xa Size=0x1
    unsigned char  Reserved;      // Offset=0xb Size=0x1
} STOR_ADDR_BTL8, *PSTOR_ADDR_BTL8;


typedef struct STOR_ADDRESS_ALIGN _STOR_ADDRESS {
    USHORT Type;
    USHORT Port;
    ULONG  AddressLength;
    UCHAR  AddressData[4];
} STOR_ADDRESS, *PSTOR_ADDRESS;


#ifndef STORPORT_W8
///////////////////////////////////////////////////////////////////
//                         Win7 storport                         //

typedef struct _RAID_POWER_STATE    // Size=0xc
{
    enum _SYSTEM_POWER_STATE SystemState;           // Offset=0x0 Size=0x4
    enum _DEVICE_POWER_STATE DeviceState;           // Offset=0x4 Size=0x4
    unsigned char            SystemPoweringDown;    // Offset=0x8 Size=0x1
} RAID_POWER_STATE;


typedef struct _PORT_CONFIGURATION_INFORMATION  // Size=0xc0
{
    unsigned long Length;                                              // Offset=0x0 Size=0x4
    unsigned long SystemIoBusNumber;                                   // Offset=0x4 Size=0x4
    enum _INTERFACE_TYPE AdapterInterfaceType;                         // Offset=0x8 Size=0x4
    unsigned long BusInterruptLevel;                                   // Offset=0xc Size=0x4
    unsigned long BusInterruptVector;                                  // Offset=0x10 Size=0x4
    enum _KINTERRUPT_MODE InterruptMode;                               // Offset=0x14 Size=0x4
    unsigned long MaximumTransferLength;                               // Offset=0x18 Size=0x4
    unsigned long NumberOfPhysicalBreaks;                              // Offset=0x1c Size=0x4
    unsigned long DmaChannel;                                          // Offset=0x20 Size=0x4
    unsigned long DmaPort;                                             // Offset=0x24 Size=0x4
    enum _DMA_WIDTH DmaWidth;                                          // Offset=0x28 Size=0x4
    enum _DMA_SPEED DmaSpeed;                                          // Offset=0x2c Size=0x4
    unsigned long AlignmentMask;                                       // Offset=0x30 Size=0x4
    unsigned long NumberOfAccessRanges;                                // Offset=0x34 Size=0x4
    struct _ACCESS_RANGE *AccessRanges;                                // Offset=0x38 Size=0x4
    void *Reserved;                                                    // Offset=0x3c Size=0x4
    unsigned char NumberOfBuses;                                       // Offset=0x40 Size=0x1
    char InitiatorBusId[8];                                            // Offset=0x41 Size=0x8
    unsigned char ScatterGather;                                       // Offset=0x49 Size=0x1
    unsigned char Master;                                              // Offset=0x4a Size=0x1
    unsigned char CachesData;                                          // Offset=0x4b Size=0x1
    unsigned char AdapterScansDown;                                    // Offset=0x4c Size=0x1
    unsigned char AtdiskPrimaryClaimed;                                // Offset=0x4d Size=0x1
    unsigned char AtdiskSecondaryClaimed;                              // Offset=0x4e Size=0x1
    unsigned char Dma32BitAddresses;                                   // Offset=0x4f Size=0x1
    unsigned char DemandMode;                                          // Offset=0x50 Size=0x1
    unsigned char MapBuffers;                                          // Offset=0x51 Size=0x1
    unsigned char NeedPhysicalAddresses;                               // Offset=0x52 Size=0x1
    unsigned char TaggedQueuing;                                       // Offset=0x53 Size=0x1
    unsigned char AutoRequestSense;                                    // Offset=0x54 Size=0x1
    unsigned char MultipleRequestPerLu;                                // Offset=0x55 Size=0x1
    unsigned char ReceiveEvent;                                        // Offset=0x56 Size=0x1
    unsigned char RealModeInitialized;                                 // Offset=0x57 Size=0x1
    unsigned char BufferAccessScsiPortControlled;                      // Offset=0x58 Size=0x1
    unsigned char MaximumNumberOfTargets;                              // Offset=0x59 Size=0x1
    unsigned char ReservedUchars[2];                                   // Offset=0x5a Size=0x2
    unsigned long SlotNumber;                                          // Offset=0x5c Size=0x4
    unsigned long BusInterruptLevel2;                                  // Offset=0x60 Size=0x4
    unsigned long BusInterruptVector2;                                 // Offset=0x64 Size=0x4
    enum _KINTERRUPT_MODE InterruptMode2;                              // Offset=0x68 Size=0x4
    unsigned long DmaChannel2;                                         // Offset=0x6c Size=0x4
    unsigned long DmaPort2;                                            // Offset=0x70 Size=0x4
    enum _DMA_WIDTH DmaWidth2;                                         // Offset=0x74 Size=0x4
    enum _DMA_SPEED DmaSpeed2;                                         // Offset=0x78 Size=0x4
    unsigned long DeviceExtensionSize;                                 // Offset=0x7c Size=0x4
    unsigned long SpecificLuExtensionSize;                             // Offset=0x80 Size=0x4
    unsigned long SrbExtensionSize;                                    // Offset=0x84 Size=0x4
    unsigned char Dma64BitAddresses;                                   // Offset=0x88 Size=0x1
    unsigned char ResetTargetSupported;                                // Offset=0x89 Size=0x1
    unsigned char MaximumNumberOfLogicalUnits;                         // Offset=0x8a Size=0x1
    unsigned char WmiDataProvider;                                     // Offset=0x8b Size=0x1
    enum _STOR_SYNCHRONIZATION_MODEL SynchronizationModel;             // Offset=0x8c Size=0x4
    unsigned char (*HwMSInterruptRoutine)(void *, unsigned long);      // Offset=0x90 Size=0x4
    enum _INTERRUPT_SYNCHRONIZATION_MODE InterruptSynchronizationMode; // Offset=0x94 Size=0x4
    struct _MEMORY_REGION DumpRegion;                                  // Offset=0x98 Size=0x18
    unsigned long RequestedDumpBufferSize;                             // Offset=0xb0 Size=0x4
    unsigned char VirtualDevice;                                       // Offset=0xb4 Size=0x1
    //unsigned char __align0[3];                                       // Offset=0xb5 Size=0x3
    unsigned long ExtendedFlags1;                                      // Offset=0xb8 Size=0x4
    unsigned long MaxNumberOfIO;                                       // Offset=0xbc Size=0x4
} PORT_CONFIGURATION_INFORMATION;


typedef struct _RAID_MINIPORT   // Size=0xd8
{
    struct _RAID_ADAPTER_EXTENSION *Adapter;                  // Offset=0x0 Size=0x4
    unsigned char __align0[4];                                // Offset=0x4 Size=0x4
    struct _PORT_CONFIGURATION_INFORMATION PortConfiguration; // Offset=0x8 Size=0xc0
    struct _HW_INITIALIZATION_DATA *HwInitializationData;     // Offset=0xc8 Size=0x4
    struct _RAID_HW_DEVICE_EXT *PrivateDeviceExt;             // Offset=0xcc Size=0x4
    unsigned char Flags[8];                                   // Offset=0xd0 Size=0x8
} RAID_MINIPORT;


typedef struct _RAID_ADAPTER_EXTENSION  // Size=0x5e0
{
    enum _RAID_OBJECT_TYPE ObjectType;              // Offset=0x0 Size=0x4
    struct _DEVICE_OBJECT *DeviceObject;            // Offset=0x4 Size=0x4
    struct _RAID_DRIVER_EXTENSION *Driver;          // Offset=0x8 Size=0x4
    struct _DEVICE_OBJECT *LowerDeviceObject;       // Offset=0xc Size=0x4
    struct _DEVICE_OBJECT *PhysicalDeviceObject;    // Offset=0x10 Size=0x4
    struct _UNICODE_STRING DeviceName;              // Offset=0x14 Size=0x8
    unsigned long PortNumber;                       // Offset=0x1c Size=0x4
    struct _LIST_ENTRY NextAdapter;                 // Offset=0x20 Size=0x8
    unsigned long SlowLock;                         // Offset=0x28 Size=0x4
    enum _DEVICE_STATE DeviceState;                 // Offset=0x2c Size=0x4
    unsigned long PagingPathCount;                  // Offset=0x30 Size=0x4
    unsigned long CrashDumpPathCount;               // Offset=0x34 Size=0x4
    unsigned long HiberPathCount;                   // Offset=0x38 Size=0x4
    unsigned long Flags;                            // Offset=0x3c Size=0x4
    struct _STOR_LOCKED_LIST UnitList;              // Offset=0x40 Size=0x10
    struct _STOR_DICTIONARY UnitDictionary;         // Offset=0x50 Size=0x1c
    struct _STOR_LOCKED_LIST ZombieList;            // Offset=0x6c Size=0x10
    unsigned char __align0[4];                      // Offset=0x7c Size=0x4
    union _SLIST_HEADER CompletedList;              // Offset=0x80 Size=0x8
    struct _EX_RUNDOWN_REF_CACHE_AWARE *RemoveLock; // Offset=0x88 Size=0x4
    struct _RAID_POWER_STATE Power;                 // Offset=0x8c Size=0xc
    struct _RAID_RESOURCE_LIST ResourceList;        // Offset=0x98 Size=0x8
    struct _RAID_MINIPORT Miniport;                 // Offset=0xa0 Size=0xd8
    struct _RAID_BUS_INTERFACE Bus;                 // Offset=0x178 Size=0x24
    struct _KINTERRUPT *Interrupt;                  // Offset=0x19c Size=0x4
    unsigned long InterruptIrql;                    // Offset=0x1a0 Size=0x4
    unsigned long InterruptVersion;                 // Offset=0x1a4 Size=0x4
    KSPIN_LOCK StartIoLock;                         // Offset=0x1a8 Size=0x4
    enum _STOR_SYNCHRONIZATION_MODEL IoModel;       // Offset=0x1ac Size=0x4
    // ...
} RAID_ADAPTER_EXTENSION, *PRAID_ADAPTER_EXTENSION;


#pragma warning(push)
#pragma warning(disable:4200)               // HwDeviceExtension[] warning
typedef struct _RAID_HW_DEVICE_EXT          // Size=0x4
{
    struct _RAID_MINIPORT *Miniport;        // Offset=0x0 Size=0x4
    unsigned char HwDeviceExtension[];      // Offset=0x4
} RAID_HW_DEVICE_EXT;
#pragma warning(pop)


typedef struct _RAID_UNIT_EXTENSION             // Size=0x2a0
{
    enum _RAID_OBJECT_TYPE ObjectType;       // Offset=0x0 Size=0x4
    struct _DEVICE_OBJECT *DeviceObject;     // Offset=0x4 Size=0x4
    struct _RAID_ADAPTER_EXTENSION *Adapter; // Offset=0x8 Size=0x4
    unsigned long SlowLock;                  // Offset=0xc Size=0x4
    enum _DEVICE_STATE DeviceState;          // Offset=0x10 Size=0x4
    struct _LIST_ENTRY NextUnit;             // Offset=0x14 Size=0x8
    struct _LIST_ENTRY UnitTableLink;        // Offset=0x1c Size=0x8
    struct _STOR_SCSI_ADDRESS Address;       // Offset=0x24 Size=0x4
    //...
} RAID_UNIT_EXTENSION, *PRAID_UNIT_EXTENSION;


#else 
///////////////////////////////////////////////////////////////////
//                       Win8+ storport                          //

typedef struct _RAID_POWER_STATE// Size=0x10
{
    enum _SYSTEM_POWER_STATE SystemState; // Offset=0x0 Size=0x4
    enum _DEVICE_POWER_STATE DeviceState; // Offset=0x4 Size=0x4
    enum _POWER_ACTION PowerAction;        // Offset=0x8 Size=0x4
    unsigned char SystemPoweringDown;     // Offset=0xc Size=0x1
} RAID_POWER_STATE;


typedef struct _PORT_CONFIGURATION_INFORMATION  // Size=0xd0
{
    unsigned long Length;                                              // Offset=0x0 Size=0x4
    unsigned long SystemIoBusNumber;                                   // Offset=0x4 Size=0x4
    enum _INTERFACE_TYPE AdapterInterfaceType;                         // Offset=0x8 Size=0x4
    unsigned long BusInterruptLevel;                                   // Offset=0xc Size=0x4
    unsigned long BusInterruptVector;                                  // Offset=0x10 Size=0x4
    enum _KINTERRUPT_MODE InterruptMode;                               // Offset=0x14 Size=0x4
    unsigned long MaximumTransferLength;                               // Offset=0x18 Size=0x4
    unsigned long NumberOfPhysicalBreaks;                              // Offset=0x1c Size=0x4
    unsigned long DmaChannel;                                          // Offset=0x20 Size=0x4
    unsigned long DmaPort;                                             // Offset=0x24 Size=0x4
    enum _DMA_WIDTH DmaWidth;                                          // Offset=0x28 Size=0x4
    enum _DMA_SPEED DmaSpeed;                                          // Offset=0x2c Size=0x4
    unsigned long AlignmentMask;                                       // Offset=0x30 Size=0x4
    unsigned long NumberOfAccessRanges;                                // Offset=0x34 Size=0x4
    struct _ACCESS_RANGE *AccessRanges;                                // Offset=0x38 Size=0x4
    void *MiniportDumpData;                                            // Offset=0x3c Size=0x4
    unsigned char NumberOfBuses;                                       // Offset=0x40 Size=0x1
    char InitiatorBusId[8];                                            // Offset=0x41 Size=0x8
    unsigned char ScatterGather;                                       // Offset=0x49 Size=0x1
    unsigned char Master;                                              // Offset=0x4a Size=0x1
    unsigned char CachesData;                                          // Offset=0x4b Size=0x1
    unsigned char AdapterScansDown;                                    // Offset=0x4c Size=0x1
    unsigned char AtdiskPrimaryClaimed;                                // Offset=0x4d Size=0x1
    unsigned char AtdiskSecondaryClaimed;                              // Offset=0x4e Size=0x1
    unsigned char Dma32BitAddresses;                                   // Offset=0x4f Size=0x1
    unsigned char DemandMode;                                          // Offset=0x50 Size=0x1
    unsigned char MapBuffers;                                          // Offset=0x51 Size=0x1
    unsigned char NeedPhysicalAddresses;                               // Offset=0x52 Size=0x1
    unsigned char TaggedQueuing;                                       // Offset=0x53 Size=0x1
    unsigned char AutoRequestSense;                                    // Offset=0x54 Size=0x1
    unsigned char MultipleRequestPerLu;                                // Offset=0x55 Size=0x1
    unsigned char ReceiveEvent;                                        // Offset=0x56 Size=0x1
    unsigned char RealModeInitialized;                                 // Offset=0x57 Size=0x1
    unsigned char BufferAccessScsiPortControlled;                      // Offset=0x58 Size=0x1
    unsigned char MaximumNumberOfTargets;                              // Offset=0x59 Size=0x1
    unsigned char SrbType;                                             // Offset=0x5a Size=0x1
    unsigned char AddressType;                                         // Offset=0x5b Size=0x1
    unsigned long SlotNumber;                                          // Offset=0x5c Size=0x4
    unsigned long BusInterruptLevel2;                                  // Offset=0x60 Size=0x4
    unsigned long BusInterruptVector2;                                 // Offset=0x64 Size=0x4
    enum _KINTERRUPT_MODE InterruptMode2;                              // Offset=0x68 Size=0x4
    unsigned long DmaChannel2;                                         // Offset=0x6c Size=0x4
    unsigned long DmaPort2;                                            // Offset=0x70 Size=0x4
    enum _DMA_WIDTH DmaWidth2;                                         // Offset=0x74 Size=0x4
    enum _DMA_SPEED DmaSpeed2;                                         // Offset=0x78 Size=0x4
    unsigned long DeviceExtensionSize;                                 // Offset=0x7c Size=0x4
    unsigned long SpecificLuExtensionSize;                             // Offset=0x80 Size=0x4
    unsigned long SrbExtensionSize;                                    // Offset=0x84 Size=0x4
    unsigned char Dma64BitAddresses;                                   // Offset=0x88 Size=0x1
    unsigned char ResetTargetSupported;                                // Offset=0x89 Size=0x1
    unsigned char MaximumNumberOfLogicalUnits;                         // Offset=0x8a Size=0x1
    unsigned char WmiDataProvider;                                     // Offset=0x8b Size=0x1
    enum _STOR_SYNCHRONIZATION_MODEL SynchronizationModel;             // Offset=0x8c Size=0x4
    unsigned char (*HwMSInterruptRoutine)(void *, unsigned long);      // Offset=0x90 Size=0x4
    enum _INTERRUPT_SYNCHRONIZATION_MODE InterruptSynchronizationMode; // Offset=0x94 Size=0x4
    struct _MEMORY_REGION DumpRegion;                                  // Offset=0x98 Size=0x18
    unsigned long RequestedDumpBufferSize;                             // Offset=0xb0 Size=0x4
    unsigned char VirtualDevice;                                       // Offset=0xb4 Size=0x1
    unsigned char DumpMode;                                            // Offset=0xb5 Size=0x1
    //unsigned char __align0[2];                                         // Offset=0xb6 Size=0x2
    unsigned long ExtendedFlags1;                                      // Offset=0xb8 Size=0x4
    unsigned long MaxNumberOfIO;                                       // Offset=0xbc Size=0x4
    unsigned long MaxIOsPerLun;                                        // Offset=0xc0 Size=0x4
    unsigned long InitialLunQueueDepth;                                // Offset=0xc4 Size=0x4
    unsigned long BusResetHoldTime;                                    // Offset=0xc8 Size=0x4
    unsigned long FeatureSupport;                                      // Offset=0xcc Size=0x4
} PORT_CONFIGURATION_INFORMATION;


struct _UNIT_CONTROL_LIST           // Size=0x10
{
    unsigned long MaxControlType;       // Offset=0x0 Size=0x4
    unsigned char SupportedTypeList[9]; // Offset=0x4 Size=0x9
};

struct _ADAPTER_CONTROL_LIST        // Size=0x14
{
    unsigned long MaxControlType;        // Offset=0x0 Size=0x4
    unsigned char SupportedTypeList[14]; // Offset=0x4 Size=0xe
};

typedef struct _RAID_MINIPORT       // Size=0x108
{
    struct _RAID_ADAPTER_EXTENSION *Adapter;                  // Offset=0x0 Size=0x4
    unsigned char __align0[4];                                // Offset=0x4 Size=0x4
    struct _PORT_CONFIGURATION_INFORMATION PortConfiguration; // Offset=0x8 Size=0xd0
    struct _HW_INITIALIZATION_DATA *HwInitializationData;     // Offset=0xd8 Size=0x4
    struct _RAID_HW_DEVICE_EXT *PrivateDeviceExt;             // Offset=0xdc Size=0x4
    unsigned char Flags;                                      // Offset=0xe0 Size=0x1
    //unsigned char __align1[3];// Offset=0xe1 Size=0x3
    struct _UNIT_CONTROL_LIST UnitControlList;                // Offset=0xe4 Size=0x10
    struct _ADAPTER_CONTROL_LIST AdapterControlList;          // Offset=0xf4 Size=0x14
} RAID_MINIPORT;


typedef struct _RAID_ADAPTER_EXTENSION  // Size=0xbc0
{
    enum _RAID_OBJECT_TYPE ObjectType;              // Offset=0x0 Size=0x4
    struct _DEVICE_OBJECT *DeviceObject;            // Offset=0x4 Size=0x4
    struct _RAID_DRIVER_EXTENSION *Driver;          // Offset=0x8 Size=0x4
    struct _DEVICE_OBJECT *LowerDeviceObject;       // Offset=0xc Size=0x4
    struct _DEVICE_OBJECT *PhysicalDeviceObject;    // Offset=0x10 Size=0x4
    struct _UNICODE_STRING DeviceName;              // Offset=0x14 Size=0x8
    unsigned long PortNumber;                       // Offset=0x1c Size=0x4
    struct _LIST_ENTRY NextAdapter;                 // Offset=0x20 Size=0x8
    unsigned long SlowLock;                         // Offset=0x28 Size=0x4
    enum _DEVICE_STATE DeviceState;                 // Offset=0x2c Size=0x4
    unsigned long PagingPathCount;                  // Offset=0x30 Size=0x4
    unsigned long CrashDumpPathCount;               // Offset=0x34 Size=0x4
    unsigned long HiberPathCount;                   // Offset=0x38 Size=0x4
    unsigned char Flags[8];                         // Offset=0x3c Size=0x8
    struct _STOR_LOCKED_LIST UnitList;              // Offset=0x44 Size=0x10
    struct _STOR_DICTIONARY UnitDictionary;         // Offset=0x54 Size=0x1c
    struct _STOR_LOCKED_LIST ZombieList;            // Offset=0x70 Size=0x10
    union _SLIST_HEADER CompletedList;              // Offset=0x80 Size=0x8
    struct _SINGLE_LIST_ENTRY *SavedXrbList;        // Offset=0x88 Size=0x4
    long AdapterDpcRoutineLock;                     // Offset=0x8c Size=0x4
    struct _EX_RUNDOWN_REF_CACHE_AWARE *RemoveLock; // Offset=0x90 Size=0x4
    struct _RAID_POWER_STATE Power;                 // Offset=0x94 Size=0x10
    struct _RAID_RESOURCE_LIST ResourceList;        // Offset=0xa4 Size=0x8
    unsigned char __align1[4];                      // Offset=0xac Size=0x4
    struct _RAID_MINIPORT Miniport;                 // Offset=0xb0 Size=0x108
    struct _RAID_BUS_INTERFACE Bus;                 // Offset=0x1b8 Size=0x24
    struct _KINTERRUPT *Interrupt;                  // Offset=0x1dc Size=0x4
    unsigned long InterruptIrql;                    // Offset=0x1e0 Size=0x4
    unsigned long InterruptVersion;                 // Offset=0x1e4 Size=0x4
    unsigned long StartIoLock;                      // Offset=0x1e8 Size=0x4
    enum _STOR_SYNCHRONIZATION_MODEL IoModel;       // Offset=0x1ec Size=0x4
    //...
} RAID_ADAPTER_EXTENSION, *PRAID_ADAPTER_EXTENSION;


typedef struct _RAID_HW_DEVICE_EXT          // Size=0x8
{
    struct _RAID_MINIPORT *Miniport;        // Offset=0x0 Size=0x4
    void *Reserved;                         // Offset=0x4 Size=0x4
    unsigned char HwDeviceExtension[];      // Offset=0x8
} RAID_HW_DEVICE_EXT;


typedef struct _RAID_UNIT_EXTENSION          // Size=0x2a0
{
    enum _RAID_OBJECT_TYPE ObjectType;       // Offset=0x0 Size=0x4
    struct _DEVICE_OBJECT *DeviceObject;     // Offset=0x4 Size=0x4
    struct _RAID_ADAPTER_EXTENSION *Adapter; // Offset=0x8 Size=0x4
    unsigned long SlowLock;                  // Offset=0xc Size=0x4
    enum _DEVICE_STATE DeviceState;          // Offset=0x10 Size=0x4
    struct _LIST_ENTRY NextUnit;             // Offset=0x14 Size=0x8
    struct _LIST_ENTRY UnitTableLink;        // Offset=0x1c Size=0x8
    union                                    // Size=0xc
    {
        struct _STOR_ADDR_BTL8 StorAddressBTL8; // Offset=0x24 Size=0xc
        struct                                  // Size=0xc
        {
            unsigned short AddressType;        // Offset=0x24 Size=0x2
            unsigned short AddressPort;        // Offset=0x26 Size=0x2
            unsigned long AddressLength;       // Offset=0x28 Size=0x4
            struct _STOR_SCSI_ADDRESS Address; // Offset=0x2c Size=0x4
        };
    };
    //...
} RAID_UNIT_EXTENSION, *PRAID_UNIT_EXTENSION;

#endif
//                       Win8+ storport                          //
///////////////////////////////////////////////////////////////////




typedef struct _STOR_TIMER_CONTEXT                 // Size=0x60
{
    RAID_ADAPTER_EXTENSION *Adapter;               // Offset=0x0 Size=0x4
    unsigned char __align0[4];                     // Offset=0x4 Size=0x4
    KTIMER                  Timer;                 // Offset=0x8 Size=0x28
    KDPC                    TimerDpc;              // Offset=0x30 Size=0x20
    void         (*Callback)(void *, void *);      // Offset=0x50 Size=0x4
    void                   *CallbackContext;       // Offset=0x54 Size=0x4
    IO_WORKITEM            *FreeTimerWorkItem;     // Offset=0x58 Size=0x4
} STOR_TIMER_CONTEXT;



/////////////////////////////////////////////////////////
// Static variables

//UNICODE_STRING StorPortInitializeName       = RTL_CONSTANT_STRING(L"StorPortInitialize");
//UNICODE_STRING StorPortRegistryReadName     = RTL_CONSTANT_STRING(L"StorPortRegistryRead");
//UNICODE_STRING StorPortExtendedFunctionName = RTL_CONSTANT_STRING(L"StorPortExtendedFunction");
// LIST_ENTRY *gPsLoadedModuleList;

static const char* DUMPPREFIX = "dump";


static BOOLEAN  gIsWeInitialized = FALSE;
       BOOLEAN  gDumpMode;

PVOID    gScsiPortMoveMemory;
PVOID    gScsiPortNotification;
PVOID    gStorPortAllocateRegistryBuffer;
PVOID    gStorPortBusy;
PVOID    gStorPortCompleteRequest;
PVOID    gStorPortConvertUlongToPhysicalAddress;
PVOID    gStorPortDebugPrint;
PVOID    gStorPortDeviceBusy;
PVOID    gStorPortDeviceReady;
PVOID    gStorPortFreeDeviceBase;
PVOID    gStorPortFreeRegistryBuffer;
